IDEA Open Model
Polygon2D.Points Property
Compatible with IDEA StatiCa Beta 20.0
 List of polygon points
 Namespace: IdeaRS.OpenModel.Geometry2D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public List<Point2D> Points { get; set; }
Public Property Points As List(Of Point2D)
	Get
	Set
Property Value
Type: List<Point2D>
See Also
Reference
Polygon2D Class
IdeaRS.OpenModel.Geometry2D Namespace